tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Quickly generate a temporary email address
brew "mailsy"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: true
# Safe, concurrent, practical language
brew "rust"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Internet file retriever
brew "wget"
# Allows connection to a computer remotely
cask "anydesk"
# Reclaim tens of gigabytes of your storage used for various Xcode caches
cask "devcleaner"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Matrix collaboration client
cask "element"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Menu bar application that displays the CPU speed limit due to thermal issues
cask "hot"
# Modpack for Minecraft 1.7.10 and 1.8.9
cask "lunar-client"
# Free and open-source RSS reader
cask "netnewswire"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Instant messaging application focusing on security
cask "signal"
# Video game digital distribution service
cask "steam"
# Open-source media center
cask "stremio"
# Mesh VPN based on Wireguard
cask "tailscale"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Wine wrapper built with SwiftUI
cask "whisky"
vscode "10nates.ollama-autocoder"
vscode "adpyke.codesnap"
vscode "bbenoist.nix"
vscode "christian-kohler.path-intellisense"
vscode "donjayamanne.githistory"
vscode "dustypomerleau.rust-syntax"
vscode "dzhavat.bracket-pair-toggler"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hars.cppsnippets"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mcu-debug.debug-tracker-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "simonsiefke.svg-preview"
vscode "sswg.swift-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-portuguese"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
